---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MeasureFromStructure
source: html/1293e82b-200a-0a83-f85d-bbe620be5032.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MeasureFromStructure Property

"Extend into wall (to core)"

## Syntax (C#)
```csharp
public static ForgeTypeId MeasureFromStructure { get; }
```